app/controllers/achievements_controller.rb

INSERT INTO "achievements" ("description", "title", "category", "lonlat", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@achievement = Achievement.new(achievement_params)
		@achievement.user = current_user

		if @achievement.save

SELECT "achievements".* FROM "achievements"
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
---
	def index
		@achievements = Achievement.includes(:user).all

SELECT  "achievements".* FROM "achievements" WHERE "achievements"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@achievement = Achievement.find(params[:id])